/*==============================================================================

   テクスチャの描画 [collision.h]
                                                         Author :
                                                         Date   :
--------------------------------------------------------------------------------

==============================================================================*/

//*****************************************************************************
// マクロ定義
//*****************************************************************************


//*****************************************************************************
// 構造体
//*****************************************************************************


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void UpdateCollision(void);
// 円同士の当たり判定
bool CollisionBC(D3DXVECTOR2 pos1, D3DXVECTOR2 pos2, float size1, float size2); //BC = バウンディングサークル
// 短形同士の当たり判定
bool CollisionBB(D3DXVECTOR2 pos1, D3DXVECTOR2 pos2, D3DXVECTOR2 size1, D3DXVECTOR2 size2); //BB = バウンディングボックス

bool CollisionBB(float posX1, float posY1, float posX2, float posY2, float sizeX1, float sizeY1, float sizeX2, float sizeY2);

bool CollisionRot(float posX1, float posY1, float posX2, float posY2, float sizeX1, float sizeY1, float sizeX2, float sizeY2, float rot2);