//===================================================
//ゲーム画面(game.h)
//Auhor:渡邉 修	Date:2023.8.4
//===================================================
#pragma once
#ifndef GAME_H_
#define GAME_H_

//---------------------------------------------------
//マクロ定義
//---------------------------------------------------

//---------------------------------------------------
//列挙体宣言
//---------------------------------------------------
typedef enum
{
	GAME_STATE_IDLE_1,
	GAME_STATE_READY,
	GAME_STATE_IDLE_2,
	GAME_STATE_START,
	GAME_STATE_PLAY,
	GAME_STATE_OVER,
	GAME_STATE_CLEAR,
}GAME_STATE;

//---------------------------------------------------
//プロトタイプ宣言
//---------------------------------------------------
void InitGame();
void UninitGame();
void UpdateGame();
void DrawGame();

#endif